using System;

//Написати програму для виконання операцій з одновимірним масивом за
//допомогою делегатів.Користувачу надається наступне меню для вибору типа
//операції з масивом:
//1. обчислення значення
//2. зміна масиву
//Якщо користувач вибрав 1-й тип, вивести підменю вибору операції:
//i.Обчислити кількість негативних елементів
//ii.Визначити суму всіх елементів
//iii. * Обрахувати кількість простих чисел
//2-й тип:
//i.Змінити всі негативні елементи на 0
//ii.Відсортувати масив
//iii. * Перемістити всі парні елементи на початку, відповідно не парні будуть в
// кінці.
//
// Створити вказані вище методи та реалізувати вибір користувачем операції на
// виконання без використання конструкцій if, switch та?:(тернарного) оператора.
//Методи першого типу повинні повертати результат обчислення, в той час методи
// другого типу – void.
//Реалізувати валідацію вибраного номера операції.

namespace CW16._03._20
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
